---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Directcontext3dSourceId
source: html/f1a92d02-7c4a-5ce8-723b-491eb52abdd9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Directcontext3dSourceId Property

"Path"

## Syntax (C#)
```csharp
public static ForgeTypeId Directcontext3dSourceId { get; }
```